# CannotAddToGroupFormatWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..CannotAddToGroupFormatWarn Property
BuiltInFailures..::..GroupFailures Class See Also
---
[Element] cannot be added to the instance of [Group]
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotAddToGroupFormatWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotAddToGroupFormatWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotAddToGroupFormatWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace